Repository: 84000/data-translation-memory
Catalog: toh54-v2.tmx
Source language: bo
Languages: en

source: གཏི་མུག་དེ་ནི་སྒྱུ་མ་འདྲ། །
en: Ignorance is like an illusion,

source: དེས་ན་དེ་ཡི་མཐའ་མི་རྙེད། །
en: And its end can therefore not be found.

source: སངས་རྒྱས་གཏི་མུག་མཉམ་པས་ན། །
en: “Since Buddha is the same as ignorance,

source: དེ་དག་གཉིས་སུ་མེད་པར་བསྟན། །
en: I have taught that they are no different.

source: རྨོངས་གྱུར་བྱིས་པ་དེ་དག་གིས། །འདིར་ནི་སངས་རྒྱས་རྣམ་པར་བརྟགས། །
en: It is confused, childish beings Who have given me the name Buddha.

source: ཐམས་ཅད་མཁྱེན་ཉིད་གཏི་མུག་མཉམ། །
en: “Omniscience and ignorance are the same;

source: གཏི་མུག་ཐམས་ཅད་ཡོད་མ་ཡིན། །
en: All ignorance is nonexistent.

source: གཏི་མུག་སེམས་ཅན་ཀུན་དང་མཉམ། །
en: Ignorance is the same as all beings,

source: སེམས་ཅན་ཀུན་ཀྱང་བསམ་མི་ཁྱབ། །
en: And all beings are inconceivable.

source: བསམ་མི་ཁྱབ་དང་གཏི་མུག་ནི། །སེམས་བསྐྱེད་པ་ཡིས་རྣམ་པར་བརྟགས། །
en: “Inconceivability and ignorance Are thus imputed by thought.

source: སེམས་ཀུན་བསམ་གྱིས་མི་ཁྱབ་སྟེ། །
en: All of the mind is inconceivable,

source: དེ་ཡི་ཚད་ནི་ཡོད་མ་ཡིན། །
en: And has no limit.

source: གཏི་མུག་དེ་ལ་ཚད་མེད་པས། །དེ་ཡི་འབྱུང་བ་རྙེད་མི་འགྱུར། །
en: “Since ignorance is immeasurable, One cannot find its origin.

source: འབྱུང་བ་ཡོད་པ་མ་ཡིན་ན། །
en: Without an origin,

source: སྐྱེ་བ་ཡོད་པར་ག་ལ་འགྱུར། །
en: How can it arise?

source: གཏི་མུག་སྐྱེས་པ་མ་ཡིན་ན། །
en: “If ignorance is unborn,

source: དེ་ཡི་རྨོངས་བྱེད་ཅི་འདྲ་ཞིག །དེ་ཡི་རྨོངས་བྱེད་ཅི་འདྲ་བ། །
en: How could it ever cause confusion? How could it ever cause confusion

source: སངས་རྒྱས་ཀུན་ཀྱང་དེ་དང་འདྲ། །ཐ་དད་དབྱེ་བ་མེད་ཤེས་ན། །
en: Is how it also is with all buddhas. “Knowing that they are neither different nor separate,

source: ཆོས་རྣམས་ཐམས་ཅད་གཉིས་སུ་མེད། །
en: And that all phenomena are nondual,

source: ཏིང་འཛིན་ཞི་བ་བརྗོད་པ་ནི། །གཏི་མུག་སྒྲ་ཡིས་རབ་ཏུ་བསྟན། །
en: I made this statement on the peace of absorption With reference to the word ignorance.

source: གང་ཚེ་ང་ཡིས་མཉམ་ཉིད་ཤེས། །
en: “When I came to know sameness,

source: དེ་ནི་དེ་དང་གཏི་མུག་མཉམ། །
en: I [understood] that ignorance was the same as it.

source: དེ་དག་ཐམས་ཅད་མཉམ་ཤེས་ནས། །ཏིང་འཛིན་དེ་ལྟར་ཤེས་པར་གྱིས། །
en: Knowing all of these to be the same, Understand absorption accordingly.

source: འཇམ་དཔལ་དེ་ལྟར་ན་གཏི་མུག་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: “Mañjuśrī, this is how you should understand ignorance to be absorption.

source: འཇམ་དཔལ་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔས་མི་དགེ་བ་ཐམས་ཅད་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱ་ཞེ་ན།
en: “Mañjuśrī, how should bodhisattvas understand all nonvirtues to be absorption?

source: འདོད་ཆགས་སྤྱོད་པའི་རྟགས་གང་དང་། །ཞེ་སྡང་སྤྱོད་པའི་གཡོ་བ་དང་། །
en: “The features of being desirous, And the turbulence of being angry,

source: གཏི་མུག་སྤྱོད་པ་གང་ཡིན་པ། །ཐམས་ཅད་ཏིང་འཛིན་ཤེས་པར་གྱིས། །
en: As well as being ignorant— Know them all to be absorption.

source: ཉོན་མོངས་ཀུན་གྱི་སྒྲུབ་པ་ནི། །ཏིང་འཛིན་ཡིན་པར་མོས་པར་གྱིས། །
en: “The production of any affliction Is absorption—be confident of that!

source: བརྫུན་དང་ཡང་དག་མ་ཡིན་པར། །ཐམས་ཅད་དེ་བཞིན་བསྒོམ་པར་གྱིས། །
en: Afflictions are false and unreal; Meditate on them all in this way.

source: འཇམ་དཔལ་དེ་ལྟར་ན་མི་དགེ་བ་ཐམས་ཅད་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: “Mañjuśrī, this is how you should understand all nonvirtues to be absorption.

source: འཇམ་དཔལ་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔས་དགེ་བ་ཐམས་ཅད་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱ་ཞེ་ན། །
en: “Mañjuśrī, how should bodhisattvas understand all virtues to be absorption?

source: སེམས་ཅན་རྣམས་ཀྱི་ཇི་སྙེད་དགེ །
en: “Whatever virtues beings may have,

source: སེམས་དང་སྤྱོད་པ་ཅི་འདྲ་བ། །སྤྱོད་པ་ཐམས་ཅད་སྤྱོད་གཅིག་སྟེ། །
en: And howsoever their minds and conduct may be, All conduct is but one conduct;

source: དེ་ལྟར་ཏིང་འཛིན་ཤེས་པར་གྱིས། །སེམས་ཅན་ཀུན་གྱི་སྤྱོད་པ་དག །
en: Know absorption to be like this! “Knowing the conduct of all beings

source: བསྒྲུབ་པ་གཅིག་ཏུ་ཤེས་པས་ན། །
en: To be but one performance,

source: ཏིང་འཛིན་ཞི་བ་བརྗོད་པ་ནི། །ཀུན་གྱི་སྒྲ་ཡིས་བསྟན་པ་ཡིན། །
en: I have made this statement on the peace of absorption With reference to the word all.

source: འཇམ་དཔལ་དེ་ལྟར་ན་དགེ་བ་ཐམས་ཅད་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: “Mañjuśrī, in this way, you should understand all virtues to be absorption.

source: འཇམ་དཔལ་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔས་འདུས་བྱས་ཐམས་ཅད་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱ་ཞེ་ན།
en: “Mañjuśrī, how should bodhisattvas understand all conditioned phenomena to be absorption?

source: འདུ་བྱེད་ཐམས་ཅད་འདུ་བྱེད་མིན། །
en: “Formations are not formations.

source: དེ་དག་བགྲང་བས་གཞལ་བྱས་ན། །
en: In terms of numerical estimation,

source: གཞལ་དུ་མེད་ཅིང་དཔག་ཏུ་མེད། །
en: They are uncountable and immeasurable—

source: དེ་ལྟར་ཏིང་འཛིན་ཤེས་པར་གྱིས། །དཔག་ཏུ་མེད་པར་ཤེས་ན་ནི། །
en: Know absorption to be so. “Knowing formations to be immeasurable,

source: ལུས་མེད་དངོས་པོ་ཡོད་མིན་པས། །ཏིང་འཛིན་ཞི་བ་བརྗོད་པ་ནི། །འདུ་བྱེད་ཀུན་གྱིས་བསྟན་པ་ཡིན། །
en: Without body or substance, I have made this statement on the peace of absorption With reference to all formations.

source: འཇམ་དཔལ་དེ་ལྟར་ན་འདུས་བྱས་ཐམས་ཅད་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: “Mañjuśrī, this is how you should understand all conditioned phenomena to be absorption.

source: འཇམ་དཔལ་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔས་འདུས་མ་བྱས་ཐམས་ཅད་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱ་ཞེ་ན།
en: “Mañjuśrī, how should bodhisattvas understand all unconditioned phenomena to be absorption?

source: ཆོས་འདི་རང་བཞིན་ཞི་བས་ན། །
en: “Since this Dharma is naturally peaceful,

source: དེ་ལ་གྲངས་ནི་ཡོད་མ་ཡིན། །
en: It is beyond number.

source: མ་རིག་པ་ཡིས་བསྒྲུབ་ཞི་བ། །ཏིང་ངེ་འཛིན་གྱིས་བསྒྲུབ་པར་བསྟན། །
en: I have taught that peace formed by ignorance Is formed by absorption.

source: འདུས་བྱས་ཀུན་ལ་བརྗོད་མེད་ཅིང་། །བསྒྲུབ་པ་མེད་པར་ཤེས་ནས་ནི། །
en: “Knowing everything conditioned to be inexpressible And uncreated,

source: སེམས་ཅན་གང་དག་བརྗོད་ལ་ཆགས། །དེ་དག་རྣམས་ལ་དེ་ལྟར་བསྟན། །
en: I have taught such To all beings who are attached to words.

source: འཇམ་དཔལ་དེ་ལྟར་ན་འདུས་མ་བྱས་ཐམས་ཅད་ཏིང་ངེ་འཛིན་དུ་རྟོགས་པར་བྱའོ། །
en: “Mañjuśrī, this is how you should understand all unconditioned phenomena to be absorption.”

source: ཚིགས་སུ་བཅད་པ་མངོན་པར་བསྒྲུབས་པའི་སྒྲ་བསམ་གྱིས་མི་ཁྱབ་པ་བསྟན་པ་འདི་བཤད་པ་ན་བྱང་ཆུབ་སེམས་དཔའ་དགུ་ཁྲི་ཉིས་སྟོང་གིས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་བོ། །
en: As he completed these verses, thus delivering this inconceivable teaching, ninety-two thousand bodhisattvas gained the acceptance of phenomena being unborn.

source: ལྷ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བདུན་ཅུ་རྩ་གཉིས་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །
en: Seventy-two sextillion gods formed the resolve to attain unsurpassed and perfect awakening.

source: དགེ་སློང་སུམ་ཁྲི་དྲུག་སྟོང་ནི་ལེན་པ་མེད་པར་ཟག་པ་རྣམས་ལས་སེམས་རྣམ་པར་གྲོལ་ལོ། །
en: Thirty-six thousand monks liberated their minds from the defilements, without further appropriation.

source: དགེ་སློང་མ་དྲུག་སྟོང་ཉིས་བརྒྱས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །
en: Six thousand two hundred nuns also formed the resolve to achieve unsurpassed and perfect awakening.

source: དགེ་བསྙེན་ས་ཡ་བརྒྱད་འབུམ་གྱིས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །
en: Eight million one hundred thousand male lay practitioners formed the resolve to achieve unsurpassed and perfect awakening.

source: དགེ་བསྙེན་མ་ས་ཡ་ཕྲག་བཞི་དང་ཉིས་འབུམ་གྱིས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །
en: Four million two hundred thousand female lay practitioners also formed the resolve to reach unsurpassed and perfect awakening.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then Prince Mañjuśrī said to the Blessed One,

source: བྱང་ཆུབ་སེམས་དཔའ་དབང་པོ་རྣོན་པོ་གང་དག་འབྱུང་བ་དེ་དག་གིས་ཏིང་ངེ་འཛིན་རྣམས་ཀྱི་མིང་ཐོས་ན་ཆོས་ཐམས་ཅད་ལ་སྣང་བ་འཐོབ་པར་འགྱུར་བ་དང་།
en: “If those bodhisattvas with sharp faculties who have come here hear the names of some absorptions, they will attain illumination in all phenomena.

source: བདུད་ཀྱི་རིས་ཀྱི་ལྷའི་བུ་ཐམས་ཅད་དང་། གང་ཟག་དམིགས་པའི་ལྟ་བ་ཅན་རྣམས་ཀྱིས་ཐུལ་བར་དཀའ་བ་དང་།
en: They will be impervious to all the gods belonging to the entourage of Māra and to those who hold the view that apprehends the person.

source: ཡི་གེ་གཅིག་གིས་ཡི་གེ་ཐམས་ཅད་རྟོགས་པར་འགྱུར་བ་དང་།
en: Through a single letter, they will understand all letters, and through all letters,

source: ཡི་གེ་ཐམས་ཅད་ཀྱིས་ཡི་གེ་གཅིག་རྟོགས་པར་འགྱུར་བ་དང་།
en: they will understand one letter.

source: ཐོགས་པ་མ་མཆིས་པའི་སྤོབས་པས་སེམས་ཅན་ཐམས་ཅད་ལ་ཆོས་སྟོན་པ་ལ་མཁས་པར་འགྱུར་བ་དང་།
en: They will become skilled in teaching the Dharma to all beings with unimpeded confident eloquence.

source: ཆོས་ཟབ་མོ་ལ་བཟོད་པར་འགྱུར་བ་དང་།
en: They will gain acceptance of the profound Dharma.

source: སྤྱོད་པ་ཐམས་ཅད་ལ་མཚན་ཉིད་གཅིག་ཏུ་རྟོགས་ཤིང་
en: They will understand all conduct to be of a single defining characteristic.

source: སོ་སོ་ཡང་དག་པར་རིག་པ་བཞིས་མུན་པ་མ་མཆིས་པར་འཐོབ་པར་འགྱུར་བའི་ཏིང་ངེ་འཛིན་རྣམས་ཀྱི་མིང་བཅོམ་ལྡན་འདས་ཀྱིས་བསྟན་དུ་གསོལ། དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: They will achieve an unobscured state through the four correct discriminations. I beseech the Blessed Ones to teach the names of these absorptions.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: To this the Blessed One responded,

source: འཇམ་དཔལ་དེའི་ཕྱིར་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་བཤད་དོ། །
en: “Mañjuśrī, to that end, listen carefully and keep in mind what I shall say.”

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་བཅོམ་ལྡན་འདས་དེ་བཞིན་ནོ་ཞེས་གསོལ་ཏེ།
en: Prince Mañjuśrī answered, “Blessed One, so be it.”

source: བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་པ་དང་།
en: He then listened as the Blessed One had directed.

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One then said,

source: འཇམ་དཔལ་མཐའ་ཡས་དྲི་མེད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དེ།
en: “Mañjuśrī, there is the absorption called the infinite immaculate.

source: ཏིང་ངེ་འཛིན་དེ་ཐོབ་ན་བྱང་ཆུབ་སེམས་དཔའ་གཟུགས་ཐམས་ཅད་ཡོངས་སུ་དག་པར་སྟོན་ཏོ། །
en: If bodhisattvas obtain this absorption, they will reveal all forms to be pure.

source: འཇམ་དཔལ་མགྱོགས་པར་འགྲོ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དེ།
en: “Mañjuśrī, there is the absorption called swift travel.

source: ཏིང་ངེ་འཛིན་དེ་ཐོབ་ན་བྱང་ཆུབ་སེམས་དཔའ་ཉི་མ་དང་། ཟླ་བའི་འོད་ཟིལ་གྱིས་གནོན་པར་བྱེད་དོ། །
en: If bodhisattvas obtain this absorption, they will outshine the light of the sun and the moon.

source: འཇམ་དཔལ་འོད་ཟེར་འབྱུང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དེ།
en: “Mañjuśrī, there is the absorption called source of light.

source: ཏིང་ངེ་འཛིན་དེ་ཐོབ་ན་བྱང་ཆུབ་སེམས་དཔའ་བརྒྱ་བྱིན་དང་། ཚངས་པ་དག་གི་གཟི་བརྗིད་ཟིལ་གྱིས་གནོན་པར་བྱེད་དོ། །
en: If bodhisattvas obtain this absorption, they will overwhelm Śakra and Brahmā in their splendor.

source: འཇམ་དཔལ་ཡུལ་སྟོན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དེ།
en: “Mañjuśrī, there is the absorption called showing the land.

source: ཏིང་ངེ་འཛིན་དེ་ཐོབ་ན་བྱང་ཆུབ་སེམས་དཔའ་འཁོར་འདུས་པ་ཐམས་ཅད་ཀྱི་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་ཞི་བར་བྱེད་དོ། །
en: If bodhisattvas obtain this absorption, they will pacify the desire, anger, and ignorance of all their assembled retinues.

source: འཇམ་དཔལ་འོད་ཟེར་ཐོགས་པ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དེ།
en: “Mañjuśrī, there is the absorption called unobstructed light.

source: ཏིང་ངེ་འཛིན་དེ་ཐོབ་ན་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་འོད་ཟེར་གྱིས་སྣང་བར་བྱེད་དོ། །
en: If bodhisattvas obtain this absorption, they will illuminate all buddha realms.

source: འཇམ་དཔལ་ཆོས་ཐམས་ཅད་མི་བརྗེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དེ།
en: “Mañjuśrī, there is the absorption called forgetting no Dharma.

source: ཏིང་ངེ་འཛིན་དེ་ཐོབ་ན་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཆོས་བསྟན་པ་ཐམས་ཅད་འཛིན་ཅིང་གཞན་ལ་ཡང་སྟོན་པར་བྱེད་དོ། །
en: If they obtain this absorption, bodhisattvas will retain all the Dharma teachings taught by the Buddha and teach them to others as well.

source: འཇམ་དཔལ་སེང་གེའི་སྒྲ་མངོན་པར་བསྒྲགས་པའི་དབྱངས་ཡིད་དུ་འོང་བ་རྗེས་སུ་སྒྲོགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དེ།
en: “Mañjuśrī, there is the absorption called imitating the pleasant sound of the lion’s roar.

source: ཏིང་ངེ་འཛིན་དེ་ཐོབ་ན་བྱང་ཆུབ་སེམས་དཔའ་ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་དུ་སྒྲས་མངོན་པར་གོ་བར་བྱེད་དོ། །
en: If they obtain this absorption, bodhisattvas will make themselves heard all the way up to the Brahmā realm.

source: འཇམ་དཔལ་དགའ་བ་དང་། མགུ་བ་དང་། ཚིམ་པ་ཐམས་ཅད་ཡང་དག་པར་བསྐྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དེ།
en: “Mañjuśrī, there is the absorption called truly creating all forms of joy, contentment, and satisfaction.

source: ཏིང་ངེ་འཛིན་དེ་ཐོབ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་དང་བསམ་པ་སྣ་ཚོགས་ཡང་དག་པར་མགུ་བར་བྱེད་དོ། །
en: If they obtain this absorption, bodhisattvas will gladden the various minds and thoughts of all sentient beings.

source: འཇམ་དཔལ་ལྟ་བས་ཆོག་མི་ཤེས་ཤིང་མཆོག་ཏུ་དགའ་བ་དང་ལྡན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དེ།
en: “Mañjuśrī, there is the absorption called captivating to behold and greatly joyous.

source: ཏིང་ངེ་འཛིན་དེ་ཐོབ་ན་བྱང་ཆུབ་སེམས་དཔའ་བལྟ་བ་དང་། མཉན་པས་ཆོག་མི་ཤེས་པར་འགྱུར་རོ། །
en: If they obtain this absorption, bodhisattvas will become captivating to behold and to listen to.

source: འཇམ་དཔལ་ཡོན་ཏན་བསམ་གྱིས་མི་ཁྱབ་པའི་འབྱུང་གནས་ཤེས་རབ་ཀྱི་ཡུལ་རིན་པོ་ཆེའི་འབྱུང་ཁུངས་རྒྱུན་ཅིག་པ་ཉོན་མོངས་པ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དེ།
en: “Mañjuśrī, there is the absorption called source of inconceivable qualities, wellspring of the precious domain of wisdom, singular stream free of affliction.

source: ཏིང་ངེ་འཛིན་དེ་ཐོབ་ན་བྱང་ཆུབ་སེམས་དཔའ་རྫུ་འཕྲུལ་བསྟན་པ་ཐམས་ཅད་སྟོན་པ་དང་། སེམས་ཅན་རྣམས་འདུལ་བར་བྱེད་དོ། །
en: If they obtain this absorption, bodhisattvas will be able to display all miracles and subdue all beings.

source: འཇམ་དཔལ་སྒྲ་སྐད་ཐམས་ཅད་ཀྱི་བརྡ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དེ།
en: “Mañjuśrī, there is the absorption called the symbol of all languages.

source: ཏིང་ངེ་འཛིན་དེ་ཐོབ་ན་བྱང་ཆུབ་སེམས་དཔའ་སྒྲ་སྐད་དང་བརྗོད་པ་དང་། བརྡ་ཐམས་ཅད་རྟོགས་ཤིང་
en: If they obtain this absorption, bodhisattvas will understand all languages, expressions, and signs.

source: ཡི་གེ་ཐམས་ཅད་ཀྱིས་ཡི་གེ་གཅིག་སྟོན་པ་དང་། ཡི་གེ་གཅིག་གིས་ཡི་གེ་ཐམས་ཅད་སྟོན་པར་བྱེད་དོ། །
en: They will reveal a single letter through all letters, and all letters through a single letter.

source: འཇམ་དཔལ་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལས་བྱུང་བའི་བསོད་ནམས་དང་། དགེ་བའི་རྩ་བ་ཐམས་ཅད་བསགས་ཤིང་སྟོན་པར་བྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དེ།
en: “Mañjuśrī, there is the absorption called accumulation and demonstration of all merit and roots of virtue arisen from ripened action.

source: ཏིང་ངེ་འཛིན་དེ་ཐོབ་ན་བྱང་ཆུབ་སེམས་དཔའ་ཅང་མི་སྨྲ་བར་སྙོམས་པར་ཞུགས་ཏེ།
en: If they obtain this absorption, bodhisattvas will remain in equipoise without saying anything.

source: ཡི་གེ་གཅིག་ཙམ་ཡང་མི་བརྗོད་པར་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་སངས་རྒྱས་ཀྱི་སྒྲ་དང་། ཆོས་ཀྱི་སྒྲ་དང་། དགེ་འདུན་གྱི་སྒྲ་དང་། ཉན་ཐོས་ཀྱི་སྒྲ་དང་། རང་སངས་རྒྱས་ཀྱི་སྒྲ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྒྲ་དང་། ཕ་རོལ་དུ་ཕྱིན་པའི་སྒྲ་ཐོས་པར་བྱེད་དོ། །
en: Without uttering a single sound, they will cause all beings to hear the words Buddha, Dharma, Saṅgha, hearers, solitary buddhas, bodhisattvas, and perfections.

source: འཇམ་དཔལ་གཟུངས་ཐམས་ཅད་ལས་མངོན་པར་འཕགས་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དེ།
en: “Mañjuśrī, there is the absorption called the exalted king of all dhāraṇīs.

source: ཏིང་ངེ་འཛིན་དེ་ཐོབ་ན་བྱང་ཆུབ་སེམས་དཔའ་གཟུངས་མཐའ་ཡས་པ་བསྒྲུབ་པ་ལ་འཇུག་པ་ཁོང་དུ་ཆུད་པར་འགྱུར་རོ། །
en: If they obtain this absorption, bodhisattvas will know how to engage in the accomplishment of infinite dhāraṇīs.

source: འཇམ་དཔལ་ཆོས་ཐམས་ཅད་ལ་སྤོབས་པ་བཀོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དེ།
en: “Mañjuśrī, there is the absorption called the array of confident eloquence in all Dharma teachings.

source: ཏིང་ངེ་འཛིན་དེ་ཐོབ་ན་བྱང་ཆུབ་སེམས་དཔའ་ཡི་གེ་ཐམས་ཅད་ལ་སྤོབས་ཤིང་སྒྲ་སྐད་ཐམས་ཅད་དང་། དབྱངས་ཐམས་ཅད་དང་། བརྗོད་པ་ཐམས་ཅད་ལ་ཡང་སྤོབས་པར་འགྱུར་རོ། །
en: If they obtain this absorption, bodhisattvas will become confidently eloquent in all utterances, languages, sounds, and expressions.”

source: བཅོམ་ལྡན་འདས་བདག་ཆོས་ཀྱི་རྣམ་གྲངས་འདིའི་ཡོན་ཏན་བརྗོད་པའི་ཁྱད་པར་ལ་སྤོབས་ལགས་སོ། །
en: “Blessed One, I have an insight to share regarding the unique description of qualities expressed in this Dharma teaching.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འཇམ་དཔལ་ཁྱོད་སྤོབས་པར་བྱོས་ཤིག །
en: The Blessed One responded, “Mañjuśrī, please share your insight.”

source: འཇམ་དཔལ་གྱིས་གསོལ་པ།
en: Mañjuśrī then said,

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་གང་དག་ནེམ་ནུར་མ་མཆིས་པ་དང་། །ཐེ་ཚོམ་མ་མཆིས་པའི་སེམས་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་སྟོན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བགྱིད་པ་དང་། གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་སྟོན་པར་བགྱིད་པ་དེ་ཚེ་འདི་ཉིད་ལ་གདོན་མི་འཚལ་བར་སྤོབས་པ་འཐོབ་པར་རེ་བར་བགྱི་སྟེ
en: “Blessed One, I wish that those bodhisattvas who are free of doubt and hesitation and who teach, hold, recite, integrate, and authentically and extensively expound this Dharma teaching to others, undoubtedly achieve confident eloquence in this very lifetime.

source: སྤོབས་པ་མྱུར་བ་དང་། སྤོབས་པ་རྒྱ་ཆེ་བ་དང་། ཟབ་མོ་ལ་སྤོབས་པ་དང་། མི་བརྗེད་པའི་སྤོབས་པ་དང་། སྤོབས་པ་སྣ་ཚོགས་ཐོབ་པར་རེ་བར་བགྱིའོ། །
en: I wish that they obtain swift confidence, vast confidence, confidence in the profound, unforgetting confidence, and variegated confidence.

source: དེ་ནི་སེམས་ཅན་ཐམས་ཅད་ལ་ཞེ་འགྲས་པ་མ་མཆིས་པའི་སེམས་སུ་གྱུར་པར་རེ་བར་བགྱིའོ། །
en: I wish that their minds become free from all animosity toward any sentient being.

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: Why do I make that wish?

source: གང་ཇི་ཙམ་དུ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བསྒྲུབ་པ་དེ་ནི་སྤྱོད་པ་འདི་ཉིད་དང་རྗེས་སུ་འབྲེལ་བ་ལགས་པའི་སླད་དུའོ། །
en: It is because the accomplishment of this Dharma teaching depends on precisely this conduct.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ
en: The Blessed One then approved of Prince Mañjuśrī, saying

source: འཇམ་དཔལ་ལེགས་སོ་ལེགས་སོ། །
en: “Mañjuśrī, excellent, excellent.

source: ཁྱོད་ཀྱིས་ཚིག་འདི་ལེགས་པར་སྨྲས་སོ། །
en: Your words are well spoken.

source: འཇམ་དཔལ་འདི་ལྟ་སྟེ། དཔེར་ན་སྦྱིན་པ་ནི་ལོངས་སྤྱོད་ཆེན་པོ་འཐོབ་པར་སླུ་བ་མེད་དོ། །
en: Mañjuśrī, for instance, it is incontrovertible that generosity yields great wealth.

source: ཚུལ་ཁྲིམས་ནི་མཐོ་རིས་སུ་སྐྱེ་བར་སླུ་བ་མེད་དོ། །
en: It is incontrovertible that discipline leads to rebirth in the upper realms.

source: ཐོས་པ་ནི་ཤེས་རབ་ཆེན་པོར་འགྱུར་བར་སླུ་བ་མེད་དོ། །
en: It is incontrovertible that study leads to great insight.

source: སྒོམ་པ་ནི་འབྲལ་བར་འགྱུར་བར་སླུ་བ་མེད་དོ། །
en: It is incontrovertible that familiarization leads to separation.

source: འཇམ་དཔལ་དེ་བཞིན་དུ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཡང་ཚེ་འདི་ཉིད་ལ་སྤོབས་པ་སྐྱེ་བར་སླུ་བ་མེད་དོ། །
en: Likewise, Mañjuśrī, it is incontrovertible that this Dharma teaching will bring forth confident eloquence in this very lifetime.

source: འཇམ་དཔལ་འདི་ལྟ་སྟེ། དཔེར་ན་ཉི་མ་ཤར་བས་ནི་མུན་པ་མུན་ནག་ཐམས་ཅད་སེལ་བར་བྱེད་དོ། །
en: “Mañjuśrī, the rising sun dispels all the thick black of darkness.

source: འཇམ་དཔལ་དེ་བཞིན་དུ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཡང་བསྟན་མ་ཐག་ཏུ་སྤོབས་པ་སྐྱེ་བར་རེ་བར་བྱའོ། །
en: Mañjuśrī, likewise, you should wish for confident eloquence to arise as soon as this Dharma teaching is delivered.

source: འཇམ་དཔལ་འདི་ལྟ་སྟེ། དཔེར་ན་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ངེས་པར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ། །
en: “Mañjuśrī, for instance, bodhisattvas who abide on the seat of awakening are certain to fully awaken to unsurpassed and perfect buddhahood.

source: འཇམ་དཔལ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་རབ་ཏུ་འདོན་པ་དེ་ཡང་ཐེ་ཚོམ་མེད་པར་ངེས་པར་ཚེ་འདི་ཉིད་ལ་སྤོབས་པ་ཐོབ་པར་འགྱུར་རོ། །
en: Likewise, Mañjuśrī, bodhisattva great beings who recite this Dharma teaching are certain to achieve confident eloquence in this very lifetime.

source: འཇམ་དཔལ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚེ་འདི་ཉིད་ལ་སྤོབས་པ་ཐོབ་པར་འདོད་པས་ནེམ་ནུར་མེད་པ་དང་། ཐེ་ཚོམ་མེད་པའི་སེམས་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་གཟུང་བར་བྱ།
en: “Mañjuśrī, therefore, bodhisattva great beings who wish to achieve confident eloquence in this very lifetime should without doubt or hesitation obtain this Dharma teaching,

source: བཅང་བར་བྱ། ཁ་ཏོན་དུ་བྱ། བཀླག་པར་བྱ། ཀུན་ཆུབ་པར་བྱ། གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་བསྟན་པར་བྱའོ། །
en: hold it, recite it, read it, understand it, and expound it extensively and correctly to others.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དྲི་མ་མེད་པའི་སྙིང་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then the bodhisattva great being Amalagarbha said to the Blessed One,

source: བཅོམ་ལྡན་འདས་བདག་གིས་ཀྱང་བཅོམ་ལྡན་འདས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་བྱང་ཆུབ་སེམས་དཔའ་གང་ནེམ་ནུར་མ་མཆིས་པ་དང་། །
en: “Blessed One, after you pass into parinirvāṇa, I too will work to ensure that those bodhisattvas who have no doubt or

source: ཐེ་ཚོམ་མ་མཆིས་པའི་སེམས་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བགྱིད་པ་དང་། གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་སྟོན་པར་འགྱུར་བ་དེ་ལ་སྤོབས་པ་ཉེ་བར་བསྒྲུབ་པར་བགྱིའོ། །
en: hesitation and who retain, hold, read, understand, and correctly and extensively expound this Dharma teaching to others achieve confident eloquence in it.”

source: དེ་ནས་བདུད་སྡིག་ཅན་ངུ་ཞིང་སྨྲེ་སྔགས་འདོན་བཞིན་དུ་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: At this point, the evil Māra came weeping and wailing before the Blessed One and said,

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ནི་ཐུགས་རྗེ་དང་ལྡན་ཞིང་སེམས་ཅན་སྡུག་བསྔལ་བ་རྣམས་ལ་བདེ་བ་རབ་ཏུ་སྩོལ་བ་ལགས་ན།
en: “Blessed One, if the thus-gone, worthy, perfect buddha is compassionate and bestows happiness to suffering beings,

source: བཅོམ་ལྡན་འདས་ཀྱིས་བདག་གི་ཡིད་མི་བདེ་བ་དེ་ལེགས་པར་བསལ་བའི་སླད་དུ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་སླར་ཞིང་བྱིན་གྱིས་མི་བརླབ་ཏུ་གསོལ།
en: then I beseech the Blessed One not to further bless this Dharma teaching, so as to dispel my own mental anguish.

source: བཅོམ་ལྡན་འདས་གང་གི་ཚེ་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་བཞུགས་པ་དང་།
en: Blessed One, when the Blessed One was seated on the seat of awakening, and

source: ད་ལྟར་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བསྟན་པའི་ཚེ་བདག་འདིར་ཤིན་དུ་ཆེར་སྡུག་བསྔལ་ཞིང་ཡིད་མི་བདེ་བ་དང་། མྱ་ངན་གྱི་ཟུག་རྔུས་གཟིར་བར་གྱུར་པ་ལགས་སོ། །
en: now as he delivered this Dharma teaching, I was tormented by intense suffering, anguish, and sorrow.

source: བཅོམ་ལྡན་འདས་ཐ་ན་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་སེམས་ཅན་གང་དག་གི་རྣ་ལམ་དུ་གྲག་པར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་སླར་མི་ལྡོག་པར་འགྱུར་ལགས་ན།
en: Blessed One, if any sentient being who so much as hears this Dharma teaching will proceed irreversibly to unsurpassed and perfect awakening,

source: གང་དག་གིས་ཐོས་ནས་འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བགྱིད་པ་དང་། གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་སྟོན་པར་བགྱིད་པ་དེ་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་སླར་མི་ལྡོག་པར་འགྱུར་བ་ལྟ་སྨོས་ཀྱང་ཅི་འཚལ་ཏེ
en: then no need to mention that those who not only hear but retain, hold, read, understand, and expound this Dharma teaching extensively and correctly to others will likewise proceed irreversibly to unsurpassed and perfect awakening.

source: སེམས་ཅན་དེ་དག་ཐམས་ཅད་ནི་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་ལགས་སོ། །
en: All these beings will fully pass into nirvāṇa.

source: བཅོམ་ལྡན་འདས་དེའི་སླད་དུ་བདག་གི་བདུད་ཀྱི་གནས་སྟོངས་པར་འགྱུར་བ་ལགས་ན་
en: Therefore, Blessed One, my māra realm will become empty.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ནི་ཐུགས་རྗེ་དང་ལྡན་ཞིང་སྡུག་བསྔལ་བ་རྣམས་ལ་བདེ་བ་སྩོལ་བ་ལགས་ན།
en: If the thus-gone, worthy, perfect buddha is compassionate and bestows happiness onto those who suffer,

source: བཅོམ་ལྡན་འདས་བདག་དབུགས་དབྱུང་དུ་གསོལ།
en: then I beseech the Blessed One to relieve my suffering.

source: བདེ་བར་གཤེགས་པ་བདག་དབུགས་དབྱུང་དུ་གསོལ།
en: I beseech the Blissful One to relieve my suffering.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བདུད་སྡིག་ཅན་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: Then the Blessed One responded to the evil Māra,

source: སྡིག་ཅན་མ་འཇིགས་ཤིག །སེམས་ཅན་ཐམས་ཅད་ཀྱང་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་མི་འགྱུར་ལ། །
en: “Evil one, do not fear. Not all sentient beings will fully pass into nirvāṇa.
